In [1]:
import pandas as pd
import numpy as np
from pydataset import data

In [2]:
#Exercises III
#1.Use your get_db_url function to help you explore the data from the chipotle database.

In [3]:
from env import host, user, password
url = f'mysql+pymysql://{user}:{password}@{host}/chipotle'

In [4]:
def get_db_url(db):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

In [5]:
sql = '''
SELECT *
FROM orders
'''''

In [6]:
df = pd.read_sql(sql, get_db_url('chipotle'))

In [7]:
df.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

In [8]:
df.tail()

,id,order_id,quantity,item_name,choice_description,item_price
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

In [9]:
df.info

<bound method DataFrame.info of         id  order_id  quantity                              item_name  \
0        1         1         1           Chips and Fresh Tomato Salsa
1        2         1         1                                   Izze
2        3         1         1                       Nantucket Nectar
3        4         1         1  Chips and Tomatillo-Green Chili Salsa
4        5         2         2                           Chicken Bowl
...    ...       ...       ...                                    ...
4617  4618      1833         1                          Steak Burrito
4618  4619      1833         1                          Steak Burrito
4619  4620      1834         1                     Chicken Salad Bowl
4620  4621      1834         1                     Chicken Salad Bowl
4621  4622      1834         1                     Chicken Salad Bowl

                                                                     choice_description  \
0                                                                                   nan
1                                                                          [Clementine]
2                                                                               [Apple]
3                                                                                   nan
4            [Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]
...                                                                                 ...
4617  [Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]
4618               [Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]
4619         [Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]
4620                                 [Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]
4621                    [Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]

     item_price
0        $2.39
1        $3.39
2        $3.39
3        $2.39
4       $16.98
...         ...
4617    $11.75
4618    $11.75
4619    $11.25
4620     $8.75
4621     $8.75

[4622 rows x 6 columns]>

In [10]:
df.size

27732

In [11]:
df.shape

(4622, 6)

In [12]:
df.columns

Index(['id', 'order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [13]:
df.describe()

                id     order_id     quantity
count  4622.000000  4622.000000  4622.000000
mean   2311.500000   927.254868     1.075725
std    1334.400802   528.890796     0.410186
min       1.000000     1.000000     1.000000
25%    1156.250000   477.250000     1.000000
50%    2311.500000   926.000000     1.000000
75%    3466.750000  1393.000000     1.000000
max    4622.000000  1834.000000    15.000000

#2. What is the total price for each order?

In [14]:
df['item_price'] = df['item_price'].str.replace('$', '')

/var/folders/kj/9tgz9jx971q_90vcdkdmfdh40000gn/T/ipykernel_1719/866725162.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['item_price'] = df['item_price'].str.replace('$', '')

In [15]:
df['item_price'] = df['item_price'].astype(float)

In [16]:
df.groupby(['order_id']).sum()

             id  quantity  item_price
order_id
1            10         4       11.56
2             5         2       16.98
3            13         2       12.67
4            17         2       21.00
5            21         2       13.70
...         ...       ...         ...
1830       9223         2       23.00
1831      13842         3       12.90
1832       9233         2       13.20
1833       9237         2       23.50
1834      13863         3       28.75

[1834 rows x 3 columns]

In [17]:
#3. What are the most popular 3 items?

In [18]:
df.groupby(['item_name']).sum().sort_values('quantity', ascending = False).head(3)

                          id  order_id  quantity  item_price
item_name
Chicken Bowl         1780635    713926       761     7342.73
Chicken Burrito      1238770    497303       591     5575.82
Chips and Guacamole  1122252    449959       506     2201.04

In [19]:
#4. Which item has produced the most revenue?

In [20]:
df.groupby(['item_name']).sum().sort_values('item_price', ascending = False).head(1)

                   id  order_id  quantity  item_price
item_name
Chicken Bowl  1780635    713926       761     7342.73

In [21]:
#5. Join the employees and titles DataFrames together.

In [27]:
url = get_db_url('employees')

In [29]:
titles = pd.read_sql('SELECT * FROM titles', url)

In [30]:
employees = pd.read_sql('SELECT * FROM employees, url)

SyntaxError: EOL while scanning string literal (1851880030.py, line 1)

In [ ]:
sql = '''
SELECT *
FROM employees
'''''

In [ ]:
sql = '''
SELECT *
FROM titles
'''''

In [ ]:
df2 = pd.read_sql(sql, get_db_url('employees'))

In [ ]:
#6. For each title, find the hire date of the employee that was hired most recently with that title

In [ ]:
all_emp_titles.groupby('title').hire_date.max()

In [ ]:
#7. Write the code necessary to create a cross tabulation of the number of titles by department. 
#(Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas 
#code to perform the manipulations.)

In [ ]:
dept_title_query = '''
                    
'''

In [ ]:
where to_date > curdate

In [ ]:
dept_titles = pd.read_sql(dept_title_query, get_db_url('employees'))
dept_titles.head()

In [ ]:
all_titles_crosstab = pd.crosstab(dept_titles.dept_name, dept_titles.title)

In [ ]:
all_titles_crosstab